"""
Collection of duels
Authors (telegrams) - @doitforgachi, @calldoctor
"""

DUELS = {
    '1v1': {
        'straight': [
            ('подстрелил', 'как свинью'),
            ('нашпиговал', 'пулями'),
            ('сделал из', 'решето'),
            ('сделал из', 'дуршлаг'),
            ('сделал из', 'сито'),
            ('сделал из', 'сито-хуито'),
            ('сделал из', 'тяночку (отстрелил мошонку)'),
            ('сделал в', 'пару новых дырок'),
            ('пораскинул мозгами', ''),
            ('принес автомат, но', 'принёс гранатомёт'),
            ],
        'inverse': [
            ('пришёл с ножом на перестрелку к', ''),
            ('пришёл на перестрелку, но подорвался на мине', ''),
            ('расстрелял', 'из автомата, но что-то пошло нет так. Ему всё похуй, он в танке'),
            ('принес автомат, но', 'принёс гранатомёт')
            ]
        },
    'self': [
        'застрелился',
        'закосплеил Курта Кобейна',
        'вступил в клуб 27',
        'долбоёб',
        'не вынес своей тупости',
        'пораскинул мозгами'
        ],
    'bot': [
        'Эээ ты совсем охренел?',
        'В жопу себе стрельни, мудак.',
        'Ты это, мушку-то спили.',
        'Щас бы с чучелом перестреливаться.',
        'Слышь, в организатора дуэли не палить.',
        'Я те щас дам дуэль лять.',
        'Ну хорошо, а что не в стену?',
        ]
    }
