"""
Collection of duels
Authors (telegrams) - @doitforgachi, @calldoctor
"""

DUELS = {
    '1v1': {
        'onedead': [
            'winner подстрелил loser как свинью',
            'winner нашпиговал loser пулями',
            'winner сделал из loser решето',
            'winner сделал из loser дуршлаг',
            'winner сделал из loser сито',
            'winner сделал из loser сито-диспасито',
            'winner сделал из loser сито-хуэсито',
            'winner сделал из loser тяночку, отстрелив ему мошонку',
            'winner сделал в loser пару новых дырок',
            'winner пораскинул мозгами loser',
            'winner пришел на перестрелку с ножем и порезал loser на колбасу',
            'У winner BFG-9000. loser стоило быть осмотрительнее',
            'Похоже winner не пришел на дуэль. А НЕТ, БОЖЕ, ОН ПРИЛЕТЕЛ НА ВЕРТОЛЁТЕ! ЭТО АПАЧ! Хана тебе, loser',
            'loser расстрелял winner из автомата, но что-то пошло нет так. Ему всё похуй, он в танке',
            'loser принес автомат, но winner принёс гранатомёт',
            'loser пришел на дуэль, но не нашел и следов winner. Это была саперная дуэль',
            'loser пришёл на перестрелку, но подорвался на мине',
            'loser пришёл с ножом на перестрелку',
            'loser не пришел на перестрелку, потому что забыл перевести время',
            ],
        'alldead': [
            'winner1 пришел на дуэль с бананом и всех взорвал. Никто не выжил нахуй!',
            'winner1 и winner2...УБИЛИ ДРУГ ДРУГА!\nОНИ УБИЛИ ДРУГ ДРУГА, КАРЛ!',
            '\U0001F33C\U0001F33C\U0001F33CMAKE LOVE NOT WAR\U0001F33C\U0001F33C\U0001F33C',
            ],
        'nonedead': [
            'loser1 и loser2 оба выстрелили в никуда!',
            ]
        },
    'suicide': [
        'loser застрелился',
        'loser закосплеил Курта Кобейна',
        'loser вступил в клуб 27',
        'loser долбоёб',
        'loser не вынес своей тупости',
        'loser пораскинул мозгами',
        'loser просто принял ислам',
        'loser мирно принял ислам',
        'loser надел пояс шахида',
        'loser вынес мусор',
        'loser изобрел тазик - эвтаназик',
        'loser убился.\nНародная мудрость: чем больше самоубийц, тем меньше самоубийц',
        'loser больше никто не видел',
        ],
    'bot': [
        'Эээ ты совсем охренел?',
        'В жопу себе стрельни, мудак.',
        'Ты это, мушку-то спили.',
        'Щас бы с чучелом перестреливаться.',
        'Слышь, в организатора дуэли не палить.',
        'Я те щас дам дуэль лять.',
        'Ну хорошо, а что не в стену?',
        ],
    }
