DUELS = {
    '1v1': [
        ('подстрелил', 'как свинью'),
        ('нашпиговал', 'пулями'),
        ('сделал из', 'решето'),
        ('сделал из', 'дуршлаг'),
        ('сделал из', 'сито'),
        ('сделал из', 'сито-хуито'),
        ('сделал в', 'пару новых дырок')
        ],
    'self': [
        'застрелился',
        'закосплеил Курта Кобейна',
        'вступил в клуб 27',
        'долбоёб',
        'не вынес своей тупости'
        ],
    'bot': [
        'Эээ ты совсем охренел?',
        'В жопу себе стрельни, мудак.'
        ]
    }