"""Collection of slaps"""
SLAPS = {
    'success': {
        'ударил': [
            'писюном',
            'бутылкой',
            'carasiqueом',
            'куриной ножкой',
            'самотыком',
            'сковородкой',
            'дакимакурой (а он и не против)',
            'банхамером',
            'этим говнокодом',
            'кружкой (ох уж это бытовое насилие)',
            'Капиталом'
            ],
        'сделал': [
            'своей тяночкой \U0001F60F'
            ],
        'обтер лицо': [
            'яйцами'
            ],
        'пукнул в лицо': [
            'гринтекстом',
            ''
            ],
        'резнул': [
            'заточкой',
            'розочкой'
            ],
        'дал': [
            'пощечину',
            'пизды'
            ],
        'ебал мамку': [
            ''
            ],
        'плюнул в борщ': [
            ''
            ],
        'поковырялся в заду': [
            'трубкой'
            ],
        'прокрался к': [
            'и пересыпал соль и сахар'
            ],
        'подскользнулся и упал на хуй': [
            ''
            ],
        'предложил': [
            'выпить пиво (в этот раз все разошлись мирно)',
            'свой анус на растерзание'
            ]
        },
    'failure': [
        'хрюкнул',
        'пукнул себе в лицо',
        'оподливился'
        ]
    }
