"""Collection of slaps"""
SLAPS = {
    'ударил': ['писюном',
               'бутылкой',
               'carasiqueом',
               'куриной ножкой',
               'самотыком',
               'сковородкой',
               'дакимакурой (а он и не против)',
               'банхамером',
               'этим говнокодом',
               'кружкой (ох уж это бытовое насилие)'],
    'обтер лицо': ['яйцами'],
    'пукнул': ['в лицо'],
    'резнул': ['заточкой',
               'розочкой'],
    'дал': ['пощечину',
            'пизды'],
    'ебал мамку' : [''],
    'подскользнулся и упал на хуй': [''],
    'предложил': ['выпить пиво (в этот раз все разошлись мирно)']
        }
