"""
Collection of duel phrases
Authors (telegrams) - @doitforgachi, @calldoctor
"""

# Word list
DUELS = {
    'onedead': [
        'winner подстрелил loser как свинью',
        'winner нашпиговал loser пулями',
        'winner сделал из loser решето',
        'winner сделал из loser дуршлаг',
        'winner сделал из loser сито',
        'winner сделал из loser сито-диспасито',
        'winner сделал из loser сито-хуэсито',
        'winner сделал из loser тяночку, отстрелив ему мошонку',
        'winner сделал в loser пару новых дырок',
        'winner пораскинул мозгами loser',
        'winner пришел на перестрелку с ножем и порезал loser на колбасу',
        'У winner BFG-9000. loser стоило быть осмотрительнее',
        'Похоже winner не пришел на дуэль. А НЕТ, БОЖЕ, ОН ПРИЛЕТЕЛ НА ВЕРТОЛЁТЕ! ЭТО АПАЧ! Хана тебе, loser',
        'loser расстрелял winner из автомата, но что-то пошло нет так. Ему всё похуй, он в танке',
        'loser принес автомат, но winner принёс гранатомёт',
        'loser пришел на дуэль, но не нашел и следов winner. Это была саперная дуэль',
        'loser пришёл на перестрелку, но подорвался на мине',
        'loser пришёл с ножом на перестрелку',
        'loser не пришел на перестрелку, потому что забыл перевести время',
        'winner поймал грудью все пули loser, но они отрикошетили! Под одеждой была печная дверца.',
        'winner просто подстрелил loser из базуки',
        'winner подстрелил loser из слонобойки. Просто и со вкусом!',
        'winner поставил хэд loser через пол карты. Етить он меткий!',
        'В ходе дуэли winner проткнул loser копьем',
        'winner ехидно насадил loser на пику',
        'loser обматерил winner, но он был в наушниках',
        'loser хотел подстрелить winner, но что-то не вышло',
        ],
    'alldead': [
        'winner1 пришел на дуэль с бананом и всех взорвал. Никто не выжил нахуй!',
        'winner1 и winner2...УБИЛИ ДРУГ ДРУГА!\nОНИ УБИЛИ ДРУГ ДРУГА, КАРЛ!',
        ],
    'nonedead': [
        'loser1 и loser2 оба выстрелили в никуда!',
        'loser1 и loser2 показали чудеса меткости(сарказм)!',
        'loser1 и loser2 оказывается косые мазилы!',
        'loser1 и loser2 совсем дебилы блять!',
        'loser1 и loser2 оказывается не знают с какой стороны хваться за оружие!',
        '\U0001F33C\U0001F33C\U0001F33CMAKE LOVE NOT WAR\U0001F33C\U0001F33C\U0001F33C',
        ],
    'suicide': [
        'loser застрелился',
        'loser закосплеил Курта Кобейна',
        'loser вступил в клуб 27',
        'loser долбоёб',
        'loser не вынес своей тупости',
        'loser пораскинул мозгами',
        'loser просто принял ислам',
        'loser мирно принял ислам',
        'loser надел пояс шахида',
        'loser вынес мусор',
        'loser изобрел тазик - эвтаназик',
        'loser убился.\nНародная мудрость: чем больше самоубийц, тем меньше самоубийц',
        'loser больше никто не видел',
        ],
    'bot': [
        'Эээ ты совсем охренел?',
        'В жопу себе стрельни, мудак.',
        'Ты это, мушку-то спили.',
        'Щас бы с чучелом перестреливаться.',
        'Слышь, в организатора дуэли не палить.',
        'Я те щас дам дуэль лять.',
        'Ну хорошо, а что не в стену?',
        ]
    }
